01-session-management/tutorial.org
#+title: Session Management
#+author: whatsmyname
#+date: today

* Introduction

In this tutorial, we'll be creating a web application with the following
characteristics:
- web server using Node.js and Express
- session management using express-session as middleware
- session storage using Redis

* Basic Web Server
:PROPERTIES:
:header-args: :results output verbatim
:header-args+: :tangle webserver.sh :mkdirp yes
:END:

To run this tutorial script, just execute ~sh webserver.sh~ in this directory.
The code has been produced from the current file.

** Environment

We need to set up the server environment first. Make sure that ~node~ is
installed and working.

#+begin_src bash
  echo -n "Testing node: "
  if type -P node > /dev/null; then
      echo "Node.js seems to be correctly installed!"
  else
      echo "Node.js command not found, please ensure it is installed and in your path!"
      exit 1
  fi
#+end_src

#+RESULTS:
: Node.js seems to be correctly installed!

Next, we set up ~package.json~ via ~npm~. This file tracks metadata like the
name of the application, version, git upstream URL, and other stuff like that.
Most importantly, it tracks the nodejs packages. We don't really care about the
metadata, so let's just use the default values.

#+begin_src bash
  echo -n "Initializing project: "
  npm init -y >/dev/null
  if [ -f "package.json" ]; then
      echo "Found package.json!"
  fi
#+end_src

#+RESULTS:
: Found package.json!

** Web Server with Express

~Express~ is a Node.js library to manage web servers. A good tutorial starting
guide can be found here: [[https://expressjs.com/en/starter/installing.html]["Getting Started"]].

First, we need to install it.

#+begin_src bash
  npm install --save express >/dev/null

  echo -n "Installing express: "
  if [ "$?" -ne 0 ]; then
      echo "npm install failed, please check logs!"
      exit 1
  else
      echo "npm install finished successfully!"
  fi
#+end_src

#+RESULTS:
: npm install finished successfully!

A simple "Hello World" application is quite easy to set up.

#+begin_src javascript :tangle hello_world/index.js :eval no
  const express = require('express')
  const app = express()
  const port = 3000

  app.get('/', (req, res) => {
      res.send('Hello World!')
  })

  app.listen(port, () => {
      console.log(`Hello World app listening at http://localhost:${port}`)
  })
#+end_src

The most important part of that snippet is the ~app.get~ function call. In
general, assuming ~app~ is the variable referring to an ~express~ object, our
basic primitive is an ~app.METHOD(PATH, HANDLER)~ function, where:
- ~METHOD~ is an HTTP request method, like GET, POST, etc., in lowercase
- ~PATH~ is the virtual path on the server (like: ~example.com/PATH~)
- ~HANDLER~ is a function taking in request and response objects

We can start this webserver as follows:

#+begin_src bash :eval no :tangle no
  node hello_world/index.js
#+end_src

In order to run this in the background, we'll need to wrap this up a bit.

#+begin_src bash :eval no
  echo -n "Starting server: "
  node hello_world/index.js & &>/dev/null
  node_pid="$!"
  echo "Started node with PID $node_pid! Please open localhost:3000 in your browser."
#+end_src

This will start a server listening at port 3000. You can check it is running
correctly with:

#+begin_src bash
  echo -n "Testing server (sleep 5 seconds): " && sleep 5

  if [ "$(curl localhost:3000 2>/dev/null)" = "Hello World!" ]; then
      echo "Server is running correctly!"
  else
      echo "Server is not running!"
  fi
#+end_src

#+RESULTS:
: Server is running correctly!

After we've done, we can quit the node server.

#+begin_src bash
  if ! [ -z "$node_pid" ]; then
      echo -n "Exit server: Press <enter> to exit... "
      read
      kill $node_pid
  fi
#+end_src

#+RESULTS:

More examples can be found on [[https://github.com/expressjs/express/tree/master/examples][Github]].

* Sessions
:PROPERTIES:
:header-args: :results output verbatim
:header-args+: :tangle webserver_sessions.sh :mkdirp yes
:END:

By session, we mean assigning every user connecting to server with a certain
session ID which determines their session. Every session can be handled
differently and can have different data.

The basic motivation for sessions is: HTTP is a stateless protocol, and in order
to have state (for example: user accounts, logged in users), we need to maintain
sessions and associate each request with a session ID.

The main way to do that is by creating a cookie with a session ID key-value
pair. In the express framework, we'll use the ~express-session~ middleware
library.

To run this tutorial, execute ~sh webserver_sessions.sh~ in this directory.

