01-session-management/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-13 Thu 06:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Session Management</title>
<meta name="author" content="whatsmyname" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Session Management</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6a3d0d3">1. Introduction</a></li>
<li><a href="#orgb90236d">2. Basic Web Server</a>
<ul>
<li><a href="#org35e86b3">2.1. Environment</a></li>
<li><a href="#org8541b0f">2.2. Web Server with Express</a></li>
</ul>
</li>
<li><a href="#org3cc5a34">3. Sessions</a>
<ul>
<li><a href="#org03c4b19">3.1. Environment</a></li>
<li><a href="#org21d3083">3.2. Basic Sessions</a></li>
<li><a href="#orgf0f0bc0">3.3. Dynamic Sessions</a></li>
<li><a href="#orgacbd1f2">3.4. Session Storage with Redis</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6a3d0d3" class="outline-2">
<h2 id="org6a3d0d3"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
In this tutorial, we'll be creating a web application with the following
characteristics:
</p>
<ul class="org-ul">
<li>web server using Node.js and Express</li>
<li>session management using express-session as middleware</li>
<li>session storage using Redis</li>
</ul>
</div>
</div>

<div id="outline-container-orgb90236d" class="outline-2">
<h2 id="orgb90236d"><span class="section-number-2">2.</span> Basic Web Server</h2>
<div class="outline-text-2" id="text-2">
<p>
To run this tutorial script, just execute <code>sh webserver.sh</code> in this directory.
The code has been produced from the current file.
</p>
</div>

<div id="outline-container-org35e86b3" class="outline-3">
<h3 id="org35e86b3"><span class="section-number-3">2.1.</span> Environment</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We need to set up the server environment first. Make sure that <code>node</code> is
installed and working.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Testing node: "</span>
<span style="color: #4f97d7; font-weight: bold;">if </span><span style="color: #4f97d7;">type</span> -P node &gt; /dev/null; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Node.js seems to be correctly installed!"</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Node.js command not found, please ensure it is installed and in your path!"</span>
    <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>

<p>
Next, we set up <code>package.json</code> via <code>npm</code>. This file tracks metadata like the
name of the application, version, git upstream URL, and other stuff like that.
Most importantly, it tracks the nodejs packages. We don't really care about the
metadata, so let's just use the default values.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Initializing project: "</span>
npm init -y &gt;/dev/null
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> -f <span style="color: #2d9574;">"package.json"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Found package.json!"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8541b0f" class="outline-3">
<h3 id="org8541b0f"><span class="section-number-3">2.2.</span> Web Server with Express</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>Express</code> is a Node.js library to manage web servers. A good tutorial starting
guide can be found here: <a href="https://expressjs.com/en/starter/installing.html">"Getting Started"</a>.
</p>

<p>
First, we need to install it.
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install --save express &gt;/dev/null

<span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Installing express: "</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #2d9574;">"$?"</span> -ne <span style="color: #a45bad;">0</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"npm install failed, please check logs!"</span>
    <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"npm install finished successfully!"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>

<p>
A simple "Hello World" application is quite easy to set up.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">express</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'express'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">app</span> = express<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">port</span> = <span style="color: #a45bad;">3000</span>

app.get<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/'</span>, <span style="color: #bc6ec5;">(</span>req, res<span style="color: #bc6ec5;">)</span> =&gt; <span style="color: #bc6ec5;">{</span>
    res.send<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'Hello World!'</span><span style="color: #2d9574;">)</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

app.listen<span style="color: #4f97d7;">(</span>port, <span style="color: #bc6ec5;">()</span> =&gt; <span style="color: #bc6ec5;">{</span>
    console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">`Hello World app listening at http://localhost:${port}`</span><span style="color: #2d9574;">)</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The most important part of that snippet is the <code>app.get</code> function call. In
general, assuming <code>app</code> is the variable referring to an <code>express</code> object, our
basic primitive is an <code>app.METHOD(PATH, HANDLER)</code> function, where:
</p>
<ul class="org-ul">
<li><code>METHOD</code> is an HTTP request method, like GET, POST, etc., in lowercase</li>
<li><code>PATH</code> is the virtual path on the server (like: <code>example.com/PATH</code>)</li>
<li><code>HANDLER</code> is a function taking in request and response objects</li>
</ul>

<p>
We can start this webserver as follows:
</p>

<div class="org-src-container">
<pre class="src src-bash">node hello_world/index.js
</pre>
</div>

<p>
In order to run this in the background, we'll need to wrap this up a bit.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Starting server: "</span>
node hello_world/index.js &amp; &amp;&gt;/dev/null
<span style="color: #7590db;">node_pid</span>=<span style="color: #2d9574;">"$!"</span>
<span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Started node with PID $node_pid! Please open localhost:3000 in your browser."</span>
</pre>
</div>

<p>
This will start a server listening at port 3000. You can check it is running
correctly with:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Testing server (sleep 5 seconds): "</span> &amp;&amp; sleep <span style="color: #a45bad;">5</span>

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #2d9574;">"$(</span><span style="color: #bc6ec5;">curl</span><span style="color: #2d9574;"> localhost:3000 2&gt;/dev/null)"</span> = <span style="color: #2d9574;">"Hello World!"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Server is running correctly!"</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Server is not running!"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>

<p>
After we've done, we can quit the node server.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> <span style="color: #4f97d7;">[</span> -z <span style="color: #2d9574;">"$node_pid"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Exit server: Press &lt;enter&gt; to exit... "</span>
    <span style="color: #4f97d7;">read</span>
    <span style="color: #4f97d7;">kill</span> $<span style="color: #7590db;">node_pid</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>

<p>
More examples can be found on <a href="https://github.com/expressjs/express/tree/master/examples">Github</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-org3cc5a34" class="outline-2">
<h2 id="org3cc5a34"><span class="section-number-2">3.</span> Sessions</h2>
<div class="outline-text-2" id="text-3">
<p>
By session, we mean assigning every user connecting to server with a certain
session ID which determines their session. Every session can be handled
differently and can have different data.
</p>

<p>
The basic motivation for sessions is: HTTP is a stateless protocol, and in order
to have state (for example: user accounts, logged in users), we need to maintain
sessions and associate each request with a session ID.
</p>

<p>
The main way to do that is by creating a cookie with a session ID key-value
pair. In the express framework, we'll use the <code>express-session</code> middleware
library.
</p>

<p>
To run this tutorial, execute <code>sh webserver_sessions.sh</code> in this directory.
</p>
</div>
