01-session-management/tutorial.org
** Environment

First, we install the required libraries.

#+begin_src bash
  npm install --save express-session > /dev/null

  echo -n "Installing express-session: "
  if [ "$?" -ne 0 ]; then
      echo "npm install failed, please check logs!"
      exit 1
  else
      echo "npm install finished successfully!"
  fi
#+end_src

#+RESULTS:
: Installing express-session: npm install finished successfully!

** Basic Sessions

Let's try to make a simple application which uses sessions.

First, the basic constants. Note that we now have ~session~ as well.

#+begin_src javascript :tangle sessions/01-static.js :eval no
  const express = require('express')
  const session = require('express-session')

  const app = express()
  const port = 3000
#+end_src

Now we set some properties for ~express-session~. The main property is the
~secret~ string, which will be used to sign session IDs. Use a strong key and do
not leak it!

The other properties are as follows:
- maxAge of cookie: how long a session lasts on inactivity
- resave: force update of session data on all requests, not needed
- saveUnitialized: save sessions even if no data is stored with it, not needed,
  but unused here
- rolling: force update of session cookie and expiration on all requests, set to
  true

The ~resave~ and ~rolling~ properties can look very similar, but be careful. The
~rolling~ property makes sure the client-side expiry is also kept up-to-date,
and the ~resave~ forces an update of the server-side expiry. The server-side
expiry is always greater or equal to the client-side expiry, but not necessarily
equal. Whenever you modify the ~req.session~ variable in any sense, the
client-side expiry will also be updated.

#+begin_src javascript :tangle sessions/01-static.js :eval no
  var session_options = {
      secret: "some_randomly_generated_string_here!",
      cookie: {
          secure: "auto",
          maxAge: 10000
      },
      resave: false,
      saveUninitialized: false,
      rolling: false,
  }

  app.use(session(session_options))
  #+end_src

Now we can start returning some information about the session.

#+begin_src javascript :tangle sessions/01-static.js :eval no
  app.get('/', (req, res) => {
      if (!req.session.initialized) {
          req.session.initialized = 0
          res.write('New session_id created!\n')
      }

      // if you don't do this, client-side cookies will expire too soon!
      // basically, you need any change to req.session to refresh cookies client-side.
      req.session.initialized++ 

      res.write('session_id: ' + req.session.id + '\n')
      res.write('expires in: ' + (req.session.cookie.maxAge / 1000) + 's\n')
      res.write('expires at: ' + (req.session.cookie.expires) + '\n')

      res.end()
  })

  app.listen(port, () => {
      console.log(`Static Sessions app listening at http://localhost:${port}`)
  })
#+end_src

Let's start the server.

#+begin_src bash :eval no
  echo -n "Starting server: "

  node sessions/01-static.js & &>/dev/null
  node_pid="$!"

  if ! [ -z "$node_pid" ]; then
      echo "Started node with PID $node_pid! Please open localhost:3000 in your browser."
      echo -n "Exit server: Press <enter> to exit... "
      read
      kill $node_pid
  else
      echo "Could not start server!"
      exit 1
  fi
#+end_src

