01-session-management/tutorial.html

<div id="outline-container-org03c4b19" class="outline-3">
<h3 id="org03c4b19"><span class="section-number-3">3.1.</span> Environment</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First, we install the required libraries.
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install --save express-session &gt; /dev/null

<span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Installing express-session: "</span>
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">[</span> <span style="color: #2d9574;">"$?"</span> -ne <span style="color: #a45bad;">0</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"npm install failed, please check logs!"</span>
    <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"npm install finished successfully!"</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org21d3083" class="outline-3">
<h3 id="org21d3083"><span class="section-number-3">3.2.</span> Basic Sessions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Let's try to make a simple application which uses sessions.
</p>

<p>
First, the basic constants. Note that we now have <code>session</code> as well.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">express</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'express'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">session</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'express-session'</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">app</span> = express<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">port</span> = <span style="color: #a45bad;">3000</span>
</pre>
</div>

<p>
Now we set some properties for <code>express-session</code>. The main property is the
<code>secret</code> string, which will be used to sign session IDs. Use a strong key and do
not leak it!
</p>

<p>
The other properties are as follows:
</p>
<ul class="org-ul">
<li>maxAge of cookie: how long a session lasts on inactivity</li>
<li>resave: force update of session data on all requests, not needed</li>
<li>saveUnitialized: save sessions even if no data is stored with it, not needed,
but unused here</li>
<li>rolling: force update of session cookie and expiration on all requests, set to
true</li>
</ul>

<p>
The <code>resave</code> and <code>rolling</code> properties can look very similar, but be careful. The
<code>rolling</code> property makes sure the client-side expiry is also kept up-to-date,
and the <code>resave</code> forces an update of the server-side expiry. The server-side
expiry is always greater or equal to the client-side expiry, but not necessarily
equal. Whenever you modify the <code>req.session</code> variable in any sense, the
client-side expiry will also be updated.
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">session_options</span> = <span style="color: #4f97d7;">{</span>
    secret: <span style="color: #2d9574;">"some_randomly_generated_string_here!"</span>,
    cookie: <span style="color: #bc6ec5;">{</span>
        secure: <span style="color: #2d9574;">"auto"</span>,
        maxAge: <span style="color: #a45bad;">10000</span>
    <span style="color: #bc6ec5;">}</span>,
    resave: <span style="color: #a45bad;">false</span>,
    saveUninitialized: <span style="color: #a45bad;">false</span>,
    rolling: <span style="color: #a45bad;">false</span>,
<span style="color: #4f97d7;">}</span>

app.use<span style="color: #4f97d7;">(</span>session<span style="color: #bc6ec5;">(</span>session_options<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Now we can start returning some information about the session.
</p>

<div class="org-src-container">
<pre class="src src-javascript">app.get<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/'</span>, <span style="color: #bc6ec5;">(</span>req, res<span style="color: #bc6ec5;">)</span> =&gt; <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>!req.session.initialized<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        req.session.initialized = <span style="color: #a45bad;">0</span>
        res.write<span style="color: #67b11d;">(</span><span style="color: #2d9574;">'New session_id created!\n'</span><span style="color: #67b11d;">)</span>
    <span style="color: #2d9574;">}</span>

    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">if you don't do this, client-side cookies will expire too soon!</span>
    <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">basically, you need any change to req.session to refresh cookies client-side.</span>
    req.session.initialized++ 

    res.write<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'session_id: '</span> + req.session.id + <span style="color: #2d9574;">'\n'</span><span style="color: #2d9574;">)</span>
    res.write<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'expires in: '</span> + <span style="color: #67b11d;">(</span>req.session.cookie.maxAge / <span style="color: #a45bad;">1000</span><span style="color: #67b11d;">)</span> + <span style="color: #2d9574;">'s\n'</span><span style="color: #2d9574;">)</span>
    res.write<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'expires at: '</span> + <span style="color: #67b11d;">(</span>req.session.cookie.expires<span style="color: #67b11d;">)</span> + <span style="color: #2d9574;">'\n'</span><span style="color: #2d9574;">)</span>

    res.end<span style="color: #2d9574;">()</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

app.listen<span style="color: #4f97d7;">(</span>port, <span style="color: #bc6ec5;">()</span> =&gt; <span style="color: #bc6ec5;">{</span>
    console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">`Static Sessions app listening at http://localhost:${port}`</span><span style="color: #2d9574;">)</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Let's start the server.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Starting server: "</span>

node sessions/01-static.js &amp; &amp;&gt;/dev/null
<span style="color: #7590db;">node_pid</span>=<span style="color: #2d9574;">"$!"</span>

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> <span style="color: #4f97d7;">[</span> -z <span style="color: #2d9574;">"$node_pid"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Started node with PID $node_pid! Please open localhost:3000 in your browser."</span>
    <span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Exit server: Press &lt;enter&gt; to exit... "</span>
    <span style="color: #4f97d7;">read</span>
    <span style="color: #4f97d7;">kill</span> $<span style="color: #7590db;">node_pid</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Could not start server!"</span>
    <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
