01-session-management/tutorial.org
** Dynamic Sessions

Let's try and make the session management a little more dynamic.

This is all basic stuff:

#+begin_src javascript :tangle sessions/02-dynamic.js :eval no
  const express = require('express')
  const session = require('express-session')

  const app = express()
  const port = 3000

  var session_options = {
      secret: "some_randomly_generated_string_here!",
      cookie: {
          secure: "auto",
          maxAge: 15000
      },
      resave: false,
      saveUninitialized: false,
      rolling: false,
  }

  app.use(session(session_options))
#+end_src

The GET response is a bit more involved now, but not too much. We check whether
we've initialized the session or not, and depending on that we show two
different views.

If it's uninitialized, we have a button to "log in". If we're initialized, we
show session ID and seconds to expiry, and buttons to "refresh expiry" and "log
out".

#+begin_src javascript :tangle sessions/02-dynamic.js :eval no
  app.get('/', (req, res) => {
      res.setHeader('Content-Type', 'text/html')
      var response_html =
          "<h1>Hello World!</h1>" +
          "<hr>"
      if (!req.session.initialized) {
          response_html +=
              "<p>You are logged out!</p>" +
              "<form action='/' method='post'>" +
              "<input type='submit' name='login' value='LOG IN'/>" +
              "</form>"
      } else {
          var ms_to_expiry = req.session.original_expiry - Date.now()
          response_html +=
              "<p>You are logged in!</p>" +
              "<ul>" +
              "<li>session_id: " + req.session.id + "</li>" +
              "<li>expiry: " + ms_to_expiry/1000 + "s (" + req.session.original_expiry_str + ") </li>" +
              "</ul>" +
              "<form action='/' method='post'>" +
              "<input type='submit' value='REFRESH PAGE'/></br>" +
              "<input type='submit' name='refresh' value='REFRESH EXPIRY'/></br></br></br>" +
              "<input type='submit' name='logout' value='LOG OUT'/>" +
              "</form>"
      }

      res.write(response_html)
      res.end()
  })
#+end_src

This is where we actually handle the POST request. We need certain middleware to
parse POST bodies, which is in the first two lines.

Depending on the POST data -- which is determined by the button ~name~ above --
we have some logic to handle log in and log out, and refreshing expiry time.
Remember that client-side cookie and expiry time would be updated only when the
session value (aka hash) changes.

Since server-side expiry time is always updated after requests, we store the
original expiry time in the session data. Date handling is ugly.

Finally, we redirect back. This is a [[https://en.wikipedia.org/wiki/Post/Redirect/Get][Post/Redirect/Get]] pattern.

#+begin_src javascript :tangle sessions/02-dynamic.js :eval no
  app.use(express.json()) // for parsing application/json
  app.use(express.urlencoded({ extended: true })) // for parsing application/x-www-form-urlencoded

  app.post('/', (req, res) => {
      if (req.body.login) {
          if (req.session.initialized) {
              console.log("ERROR: login after being initialized!")
          }
          req.session.initialized = true
          req.session.original_expiry = Date.parse(req.session.cookie.expires)
          req.session.original_expiry_str = new Date(req.session.original_expiry).toLocaleString("en-GB")
          req.session.refresh_flag = false
      } else if (req.body.logout) {
          req.session.regenerate((err) => { } )
      } else if (req.body.refresh) {
          req.session.refresh_flag = !req.session.refresh_flag
          req.session.original_expiry = Date.now() + req.session.cookie.originalMaxAge
          req.session.original_expiry_str = new Date(req.session.original_expiry).toLocaleString("en-GB")
      }

      res.redirect('/')
      res.end()
  })

  app.listen(port, () => {
      console.log(`Dynamic Sessions app listening at http://localhost:${port}`)
  })
#+end_src

Again, let's start the server.

#+begin_src bash :eval no
  echo -n "Starting server: "

  node sessions/02-dynamic.js & &>/dev/null
  node_pid="$!"

  if ! [ -z "$node_pid" ]; then
      echo "Started node with PID $node_pid! Please open localhost:3000 in your browser."
      echo -n "Exit server: Press <enter> to exit... "
      read
      kill $node_pid
  else
      echo "Could not start server!"
      exit 1
  fi
#+end_src

