01-session-management/tutorial.html

<div id="outline-container-orgf0f0bc0" class="outline-3">
<h3 id="orgf0f0bc0"><span class="section-number-3">3.3.</span> Dynamic Sessions</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Let's try and make the session management a little more dynamic.
</p>

<p>
This is all basic stuff:
</p>

<div class="org-src-container">
<pre class="src src-javascript"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">express</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'express'</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">session</span> = require<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'express-session'</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">app</span> = express<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">port</span> = <span style="color: #a45bad;">3000</span>

<span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">session_options</span> = <span style="color: #4f97d7;">{</span>
    secret: <span style="color: #2d9574;">"some_randomly_generated_string_here!"</span>,
    cookie: <span style="color: #bc6ec5;">{</span>
        secure: <span style="color: #2d9574;">"auto"</span>,
        maxAge: <span style="color: #a45bad;">15000</span>
    <span style="color: #bc6ec5;">}</span>,
    resave: <span style="color: #a45bad;">false</span>,
    saveUninitialized: <span style="color: #a45bad;">false</span>,
    rolling: <span style="color: #a45bad;">false</span>,
<span style="color: #4f97d7;">}</span>

app.use<span style="color: #4f97d7;">(</span>session<span style="color: #bc6ec5;">(</span>session_options<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The GET response is a bit more involved now, but not too much. We check whether
we've initialized the session or not, and depending on that we show two
different views.
</p>

<p>
If it's uninitialized, we have a button to "log in". If we're initialized, we
show session ID and seconds to expiry, and buttons to "refresh expiry" and "log
out".
</p>

<div class="org-src-container">
<pre class="src src-javascript">app.get<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/'</span>, <span style="color: #bc6ec5;">(</span>req, res<span style="color: #bc6ec5;">)</span> =&gt; <span style="color: #bc6ec5;">{</span>
    res.setHeader<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'Content-Type'</span>, <span style="color: #2d9574;">'text/html'</span><span style="color: #2d9574;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">response_html</span> =
        <span style="color: #2d9574;">"&lt;h1&gt;Hello World!&lt;/h1&gt;"</span> +
        <span style="color: #2d9574;">"&lt;hr&gt;"</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>!req.session.initialized<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        response_html +=
            <span style="color: #2d9574;">"&lt;p&gt;You are logged out!&lt;/p&gt;"</span> +
            <span style="color: #2d9574;">"&lt;form action='/' method='post'&gt;"</span> +
            <span style="color: #2d9574;">"&lt;input type='submit' name='login' value='LOG IN'/&gt;"</span> +
            <span style="color: #2d9574;">"&lt;/form&gt;"</span>
    <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #2d9574;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">var</span> <span style="color: #7590db;">ms_to_expiry</span> = req.session.original_expiry - Date.now<span style="color: #67b11d;">()</span>
        response_html +=
            <span style="color: #2d9574;">"&lt;p&gt;You are logged in!&lt;/p&gt;"</span> +
            <span style="color: #2d9574;">"&lt;ul&gt;"</span> +
            <span style="color: #2d9574;">"&lt;li&gt;session_id: "</span> + req.session.id + <span style="color: #2d9574;">"&lt;/li&gt;"</span> +
            <span style="color: #2d9574;">"&lt;li&gt;expiry: "</span> + ms_to_expiry/<span style="color: #a45bad;">1000</span> + <span style="color: #2d9574;">"s ("</span> + req.session.original_expiry_str + <span style="color: #2d9574;">") &lt;/li&gt;"</span> +
            <span style="color: #2d9574;">"&lt;/ul&gt;"</span> +
            <span style="color: #2d9574;">"&lt;form action='/' method='post'&gt;"</span> +
            <span style="color: #2d9574;">"&lt;input type='submit' value='REFRESH PAGE'/&gt;&lt;/br&gt;"</span> +
            <span style="color: #2d9574;">"&lt;input type='submit' name='refresh' value='REFRESH EXPIRY'/&gt;&lt;/br&gt;&lt;/br&gt;&lt;/br&gt;"</span> +
            <span style="color: #2d9574;">"&lt;input type='submit' name='logout' value='LOG OUT'/&gt;"</span> +
            <span style="color: #2d9574;">"&lt;/form&gt;"</span>
    <span style="color: #2d9574;">}</span>

    res.write<span style="color: #2d9574;">(</span>response_html<span style="color: #2d9574;">)</span>
    res.end<span style="color: #2d9574;">()</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
This is where we actually handle the POST request. We need certain middleware to
parse POST bodies, which is in the first two lines.
</p>

<p>
Depending on the POST data &#x2013; which is determined by the button <code>name</code> above &#x2013;
we have some logic to handle log in and log out, and refreshing expiry time.
Remember that client-side cookie and expiry time would be updated only when the
session value (aka hash) changes.
</p>

<p>
Since server-side expiry time is always updated after requests, we store the
original expiry time in the session data. Date handling is ugly.
</p>

<p>
Finally, we redirect back. This is a <a href="https://en.wikipedia.org/wiki/Post/Redirect/Get">Post/Redirect/Get</a> pattern.
</p>

<div class="org-src-container">
<pre class="src src-javascript">app.use<span style="color: #4f97d7;">(</span>express.json<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">for parsing application/json</span>
app.use<span style="color: #4f97d7;">(</span>express.urlencoded<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">{</span> extended: <span style="color: #a45bad;">true</span> <span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">for parsing application/x-www-form-urlencoded</span>

app.post<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'/'</span>, <span style="color: #bc6ec5;">(</span>req, res<span style="color: #bc6ec5;">)</span> =&gt; <span style="color: #bc6ec5;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>req.body.login<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>req.session.initialized<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
            console.log<span style="color: #b1951d;">(</span><span style="color: #2d9574;">"ERROR: login after being initialized!"</span><span style="color: #b1951d;">)</span>
        <span style="color: #67b11d;">}</span>
        req.session.initialized = <span style="color: #a45bad;">true</span>
        req.session.original_expiry = Date.parse<span style="color: #67b11d;">(</span>req.session.cookie.expires<span style="color: #67b11d;">)</span>
        req.session.original_expiry_str = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Date</span><span style="color: #67b11d;">(</span>req.session.original_expiry<span style="color: #67b11d;">)</span>.toLocaleString<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"en-GB"</span><span style="color: #67b11d;">)</span>
        req.session.refresh_flag = <span style="color: #a45bad;">false</span>
    <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>req.body.logout<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        req.session.regenerate<span style="color: #67b11d;">(</span><span style="color: #b1951d;">(</span>err<span style="color: #b1951d;">)</span> =&gt; <span style="color: #b1951d;">{</span> <span style="color: #b1951d;">}</span> <span style="color: #67b11d;">)</span>
    <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>req.body.refresh<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
        req.session.refresh_flag = !req.session.refresh_flag
        req.session.original_expiry = Date.now<span style="color: #67b11d;">()</span> + req.session.cookie.originalMaxAge
        req.session.original_expiry_str = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">Date</span><span style="color: #67b11d;">(</span>req.session.original_expiry<span style="color: #67b11d;">)</span>.toLocaleString<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"en-GB"</span><span style="color: #67b11d;">)</span>
    <span style="color: #2d9574;">}</span>

    res.redirect<span style="color: #2d9574;">(</span><span style="color: #2d9574;">'/'</span><span style="color: #2d9574;">)</span>
    res.end<span style="color: #2d9574;">()</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

app.listen<span style="color: #4f97d7;">(</span>port, <span style="color: #bc6ec5;">()</span> =&gt; <span style="color: #bc6ec5;">{</span>
    console.log<span style="color: #2d9574;">(</span><span style="color: #2d9574;">`Dynamic Sessions app listening at http://localhost:${port}`</span><span style="color: #2d9574;">)</span>
<span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Again, let's start the server.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Starting server: "</span>

node sessions/02-dynamic.js &amp; &amp;&gt;/dev/null
<span style="color: #7590db;">node_pid</span>=<span style="color: #2d9574;">"$!"</span>

<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #a45bad;">!</span> <span style="color: #4f97d7;">[</span> -z <span style="color: #2d9574;">"$node_pid"</span> <span style="color: #4f97d7;">]</span>; <span style="color: #4f97d7; font-weight: bold;">then</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Started node with PID $node_pid! Please open localhost:3000 in your browser."</span>
    <span style="color: #4f97d7;">echo</span> -n <span style="color: #2d9574;">"Exit server: Press &lt;enter&gt; to exit... "</span>
    <span style="color: #4f97d7;">read</span>
    <span style="color: #4f97d7;">kill</span> $<span style="color: #7590db;">node_pid</span>
<span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #4f97d7;">echo</span> <span style="color: #2d9574;">"Could not start server!"</span>
    <span style="color: #4f97d7; font-weight: bold;">exit</span> <span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">fi</span>
</pre>
</div>
</div>
</div>
